app/Services/InventoryService.php

SELECT *
FROM `branch_stock`
WHERE `branch_id` = '1'
AND `item_id` = '1'
SELECT *
FROM `items`
WHERE `id` = '1'
AND `status` = 'active'
---
    public function checkStockAlerts($branchId, $itemId)
    {
        $stock = $this->db->table('branch_stock')
            ->where('branch_id', $branchId)
            ->where('item_id', $itemId)
            ->get()
            ->getRow();

        $item = $this->db->table('items')
            ->where('id', $itemId)
            ->where('status', 'active')
            ->get()
            ->getRow();

SELECT `items`.`id` as `item_id`, `items`.`name`, `items`.`reorder_level`, `items`.`perishable`, `branch_stock`.`quantity`, `branch_stock`.`expiry_date`, `branch_stock`.`branch_id`
FROM `items`
LEFT JOIN `branch_stock` ON `items`.`id` = `branch_stock`.`item_id`
WHERE `items`.`status` = 'active'
AND `branch_stock`.`branch_id` = '1'
---
    public function checkAllAlerts($branchId = null)
    {
        $query = $this->db->table('items')
            ->select('items.id as item_id, items.name, items.reorder_level, items.perishable, branch_stock.quantity, branch_stock.expiry_date, branch_stock.branch_id')
            ->join('branch_stock', 'items.id = branch_stock.item_id', 'left')
            ->where('items.status', 'active');

        if ($branchId) {
            $query->where('branch_stock.branch_id', $branchId);
        }

        $items = $query->get()->getResultArray();