app/Controllers/Auth.php

    public function login()
    {
        if ($this->request->getMethod() === 'POST') {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            try {
                $userModel = new UserModel();
                $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'supplier1'
 LIMIT 1

    public function dashboard()
    {
        $user = session()->get('user');
        if (!$user) {
            return redirect()->to(base_url('login'));
        }

        $data = [];

        // If branch user, get branch-specific data
        if (in_array($user['role'], ['Inventory Staff', 'Branch Manager']) && isset($user['branch_id'])) {
            $branchId = $user['branch_id'];
            $db = \Config\Database::connect();

            // Get branch information
            $branch = $db->table('branches')
                ->where('id', $branchId)
                ->get()
                ->getRow();

            if ($branch) {
                // Get inventory stats for this specific branch
                $inventory = $db->table('items')
                    ->select('items.id as item_id, items.name as item_name, items.unit, items.reorder_level, branch_stock.quantity')
                    ->join('branch_stock', 'items.id = branch_stock.item_id AND branch_stock.branch_id = ' . $branchId, 'left')
                    ->where('items.status', 'active')
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `branches`
WHERE `id` = '1'
SELECT `items`.`id` as `item_id`, `items`.`name` as `item_name`, `items`.`unit`, `items`.`reorder_level`, `branch_stock`.`quantity`
FROM `items`
LEFT JOIN `branch_stock` ON `items`.`id` = `branch_stock`.`item_id` AND `branch_stock`.`branch_id` = 1
WHERE `items`.`status` = 'active'

            $db = \Config\Database::connect();

            // Get total branches
            $totalBranches = $db->table('branches')->countAllResults(false);

            // Get active deliveries (in_transit or scheduled)
            $activeDeliveries = $db->table('deliveries')
                ->whereIn('status', ['scheduled', 'in_transit'])
                ->countAllResults(false);

            // Get pending purchase orders
            $pendingOrders = $db->table('purchase_orders')
                ->whereIn('status', ['pending', 'approved'])
                ->countAllResults(false);

            // Get total suppliers (including deleted)
            $totalSuppliers = $db->table('suppliers')->countAllResults(false);

            // Get deleted suppliers count
            $deletedSuppliers = $db->table('suppliers')
                ->where('deleted_at IS NOT NULL', null, false)
                ->countAllResults(false);

            // Get today's highlights
            $today = date('Y-m-d');
            $scheduledDeliveries = $db->table('deliveries')
                ->where('status', 'scheduled')
                ->where('DATE(scheduled_time)', $today)
                ->countAllResults(false);

            $pendingPRs = $db->table('purchase_requests')
                ->whereIn('status', ['pending', 'pending central office review'])
                ->countAllResults(false);

            // Get low stock items
            $lowStockQuery = $db->table('branch_stock bs')
                ->select('bs.*, i.reorder_level')
                ->join('items i', 'bs.item_id = i.id')
                ->where('bs.quantity >', 0)
                ->get()
                ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `branches`
SELECT COUNT(*) AS `numrows`
FROM `deliveries`
WHERE `status` IN ('scheduled','in_transit')
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
WHERE `status` IN ('pending','approved')
SELECT COUNT(*) AS `numrows`
FROM `suppliers`
SELECT COUNT(*) AS `numrows`
FROM `suppliers`
WHERE deleted_at IS NOT NULL
SELECT COUNT(*) AS `numrows`
FROM `deliveries`
WHERE `status` = 'scheduled'
AND DATE(scheduled_time) = '2025-12-17'
SELECT COUNT(*) AS `numrows`
FROM `purchase_requests`
WHERE `status` IN ('pending_central_office_review')
SELECT `bs`.*, `i`.`reorder_level`
FROM `branch_stock` `bs`
JOIN `items` `i` ON `bs`.`item_id` = `i`.`id`
WHERE `bs`.`quantity` > 0

            }

            // Get recent activity (from stock_movements)
            $recentActivity = $db->table('stock_movements sm')
                ->select('sm.*, i.name as item_name, b.name as branch_name, u.username')
                ->join('items i', 'sm.item_id = i.id', 'left')
                ->join('branches b', 'sm.branch_id = b.id', 'left')
                ->join('users u', 'sm.created_by = u.id', 'left')
                ->orderBy('sm.created_at', 'DESC')
                ->limit(10)
                ->get()
                ->getResultArray();
---
SELECT `sm`.*, `i`.`name` as `item_name`, `b`.`name` as `branch_name`, `u`.`username`
FROM `stock_movements` `sm`
LEFT JOIN `items` `i` ON `sm`.`item_id` = `i`.`id`
LEFT JOIN `branches` `b` ON `sm`.`branch_id` = `b`.`id`
LEFT JOIN `users` `u` ON `sm`.`created_by` = `u`.`id`
ORDER BY `sm`.`created_at` DESC
 LIMIT 10