app/Controllers/Inventory.php

SELECT *
FROM `branches`
WHERE `id` = '1'
SELECT `items`.`id` as `item_id`, `items`.`name` as `item_name`, `items`.`unit`, `items`.`reorder_level`, `branch_stock`.`quantity`
FROM `items`
LEFT JOIN `branch_stock` ON `items`.`id` = `branch_stock`.`item_id` AND `branch_stock`.`branch_id` = 1
WHERE `items`.`status` = 'active'
---
    public function bdashboard(): string
    {
        // Get current user's branch
        $user = session()->get('user');
        if (!$user || !isset($user['branch_id']) || $user['branch_id'] === null) {
            // If user doesn't have a branch assigned, redirect to main dashboard
            return redirect()->to(base_url('dashboard'))->with('error', 'No branch assigned to your account');
        }

        $branchId = $user['branch_id'];
        $db = \Config\Database::connect();

        // Get branch information
        $branch = $db->table('branches')
            ->where('id', $branchId)
            ->get()
            ->getRow();

        if (!$branch) {
            return redirect()->to(base_url('dashboard'))->with('error', 'Branch not found');
        }

        // Get inventory stats for this specific branch
        $inventory = $db->table('items')
            ->select('items.id as item_id, items.name as item_name, items.unit, items.reorder_level, branch_stock.quantity')
            ->join('branch_stock', 'items.id = branch_stock.item_id AND branch_stock.branch_id = ' . $branchId, 'left')
            ->where('items.status', 'active')
            ->get()
            ->getResultArray();