app/Controllers/Inventory.php

    private function getDeliveriesFromDatabase($branchId = null)
    {
        try {
            $db = \Config\Database::connect();

            // Build query to get deliveries with branch names and all delivery items
            $query = $db->table('deliveries d')
                ->select('d.*, b.name as branch_name, GROUP_CONCAT(CONCAT(di.quantity, " ", i.name) SEPARATOR ", ") as items')
                ->join('branches b', 'd.branch_id = b.id')
                ->join('delivery_items di', 'd.delivery_id = di.delivery_id', 'left')
                ->join('items i', 'di.item_id = i.id', 'left')
                ->groupBy('d.id')
                ->orderBy('d.scheduled_time', 'ASC');

            // Filter by branch if provided
            if ($branchId) {
                $query->where('d.branch_id', $branchId);
            }

            $deliveries = $query->get()->getResultArray();
---
SELECT `d`.*, `b`.`name` as `branch_name`, GROUP_CONCAT(CONCAT(di.quantity, " ", i.name) SEPARATOR ", ") as items
FROM `deliveries` `d`
JOIN `branches` `b` ON `d`.`branch_id` = `b`.`id`
LEFT JOIN `delivery_items` `di` ON `d`.`delivery_id` = `di`.`delivery_id`
LEFT JOIN `items` `i` ON `di`.`item_id` = `i`.`id`
WHERE `d`.`branch_id` = '1'
GROUP BY `d`.`id`
ORDER BY `d`.`scheduled_time` ASC