app/Controllers/PurchaseOrder.php

SELECT *
FROM `suppliers`
WHERE `status` = 'Active'
AND `suppliers`.`deleted_at` IS NULL
SELECT *
FROM `items`
WHERE `status` = 'active'
SELECT *
FROM `purchase_requests`
WHERE `status` = 'approved'
SELECT *
FROM `suppliers`
WHERE `status` = 'Active'
SELECT *
FROM `branches`
---
    public function index()
    {
        $user = session()->get('user');
        if (!$user) {
            return redirect()->to(base_url('login'));
        }

        $branchId = null;
        $supplierId = null;

        if (in_array($user['role'], ['Inventory Staff', 'Branch Manager']) && isset($user['branch_id'])) {
            $branchId = $user['branch_id'];
        }

        // For Supplier role, filter by supplier (if supplier_id is stored in user session or can be determined)
        // For now, Supplier role users can see all POs assigned to any supplier
        // In a production system, you'd link users to suppliers via a user_supplier_id field

        $data = [
            'orders' => $this->purchaseOrderModel->getOrdersWithDetails($branchId, $supplierId),
            'stats' => $this->purchaseOrderModel->getStats($branchId, $supplierId),
            'suppliers' => $this->supplierModel->where('status', 'Active')->findAll(),
            'branches' => $this->branchModel->findAll(),
            'items' => $this->itemModel->where('status', 'active')->findAll(),
            'approvedRequests' => $this->purchaseRequestModel->where('status', 'approved')->findAll(),
            'userRole' => $user['role'],
            'branchId' => $branchId,
            'supplierId' => $supplierId,
        ];

SELECT `poi`.*, `i`.`name` as `item_name_from_db`, `i`.`unit` as `item_unit_from_db`
FROM `purchase_order_items` `poi`
LEFT JOIN `items` `i` ON `poi`.`item_id` = `i`.`id`
WHERE `poi`.`purchase_order_id` = '2'
---
        // Load items for each order with proper joins to ensure item data
        $db = \Config\Database::connect();
        foreach ($data['orders'] as &$order) {
            $order['items'] = $db->table('purchase_order_items poi')
                ->select('poi.*, i.name as item_name_from_db, i.unit as item_unit_from_db')
                ->join('items i', 'poi.item_id = i.id', 'left')
                ->where('poi.purchase_order_id', $order['id'])
                ->get()
                ->getResultArray();

SELECT *
FROM `purchase_orders`
WHERE `purchase_orders`.`id` = '3'
---
    public function updateDeliveryTimeline($id)
    {
        $user = session()->get('user');
        if (!$user || !in_array($user['role'], ['Logistics Coordinator', 'Supplier'])) {
            return $this->response->setJSON(['success' => false, 'message' => 'Unauthorized - Logistics Coordinator or Supplier access only']);
        }

        try {
            $order = $this->purchaseOrderModel->find($id);

UPDATE `purchase_orders` SET `status` = 'in_transit', `updated_at` = '2025-12-16 17:37:26'
WHERE `purchase_orders`.`id` IN ('3')
---
                $updateData['notes'] = $existingNotes . "\n\n[Logistics Update - {$timestamp}]: " . $deliveryNotes;
            }

            $this->purchaseOrderModel->update($id, $updateData);

SELECT *
FROM `suppliers`
WHERE `suppliers`.`deleted_at` IS NULL
AND `suppliers`.`id` = '1'
SELECT `poi`.*, `i`.`name` as `item_name_from_db`, `i`.`unit` as `item_unit_from_db`
FROM `purchase_order_items` `poi`
LEFT JOIN `items` `i` ON `poi`.`item_id` = `i`.`id`
WHERE `poi`.`purchase_order_id` = '3'
---
    public function supplierOrders()
    {
        $user = session()->get('user');
        if (!$user || $user['role'] !== 'Supplier') {
            return redirect()->to(base_url('login'));
        }

        $supplierId = $user['supplier_id'] ?? null;
        if (!$supplierId) {
            return redirect()->to(base_url('dashboard'))->with('error', 'Supplier account not properly configured');
        }

        // Get supplier info
        $supplier = $this->supplierModel->find($supplierId);

        $data = [
            'orders' => $this->purchaseOrderModel->getOrdersWithDetails(null, $supplierId),
            'stats' => $this->purchaseOrderModel->getStats(null, $supplierId),
            'supplier' => $supplier,
        ];

        // Filter out orders that are still waiting for scheduling (pending_delivery_schedule)
        // Suppliers should only see orders that have been scheduled or are in progress
        $data['orders'] = array_filter($data['orders'], function($order) {
            return $order['status'] !== 'pending_delivery_schedule';
        });

        // Load items for each order with proper joins to ensure item data
        $db = \Config\Database::connect();
        foreach ($data['orders'] as &$order) {
            $order['items'] = $db->table('purchase_order_items poi')
                ->select('poi.*, i.name as item_name_from_db, i.unit as item_unit_from_db')
                ->join('items i', 'poi.item_id = i.id', 'left')
                ->where('poi.purchase_order_id', $order['id'])
                ->get()
                ->getResultArray();

SELECT *
FROM `purchase_order_items`
WHERE `purchase_order_id` = '3'
INSERT INTO `deliveries` (`delivery_id`, `purchase_order_id`, `branch_id`, `supplier_id`, `driver`, `status`, `scheduled_time`, `notes`, `created_by`) VALUES ('DLV-003', '3', '1', '1', 'Delivery Driver', 'in_transit', '2025-12-16 17:37:26', 'Delivery for PO: PO-003', '9')
---
    private function createDeliveryFromPO($order, $user)
    {
        try {
            // Load required models
            $deliveryModel = new \App\Models\DeliveryModel();

            // Generate delivery ID
            $deliveryId = $deliveryModel->generateDeliveryId();

            // Get PO items
            $poItems = $this->purchaseOrderItemModel->where('purchase_order_id', $order['id'])->findAll();

            // Create delivery record (main delivery info only)
            $deliveryData = [
                'delivery_id' => $deliveryId,
                'purchase_order_id' => $order['id'],
                'branch_id' => $order['branch_id'],
                'supplier_id' => $order['supplier_id'],
                'driver_name' => 'Delivery Driver',
                'status' => 'in_transit',
                'scheduled_time' => date('Y-m-d H:i:s'),
                'departure_time' => date('Y-m-d H:i:s'),
                'notes' => "Delivery for PO: {$order['po_id']}",
                'created_by' => $user['id'],
            ];

            $deliveryRecordId = $deliveryModel->insert($deliveryData);

INSERT INTO `delivery_items` (`delivery_id`, `item_id`, `item_name`, `quantity`, `unit`, `unit_price`, `status`, `created_at`, `updated_at`) VALUES ('DLV-003', NULL, 'adadasd', '1.00', 'g', '0.00', 'in_transit', '2025-12-16 17:37:26', '2025-12-16 17:37:26')
---
                    'updated_at' => date('Y-m-d H:i:s'),
                ];

                $insertResult = $this->deliveryItemModel->insert($deliveryItemData);

SELECT *
FROM `deliveries`
WHERE `purchase_order_id` = '3'
 LIMIT 1
UPDATE `deliveries` SET `status` = 'in_transit', `updated_at` = '2025-12-16 17:37:26'
WHERE `deliveries`.`id` IN ('3')
UPDATE `delivery_items` SET `status` = 'in_transit', `updated_at` = '2025-12-16 17:37:26'
WHERE `delivery_id` = 'DLV-003'
---
    private function updateDeliveryStatus($purchaseOrderId, $newStatus)
    {
        try {
            // Find delivery record linked to this PO
            $delivery = $this->deliveryModel->where('purchase_order_id', $purchaseOrderId)->first();

            if ($delivery) {
                // Map PO status to delivery status
                $deliveryStatus = $this->mapPOStatusToDeliveryStatus($newStatus);

                if ($deliveryStatus) {
                    $this->deliveryModel->update($delivery['id'], [
                        'status' => $deliveryStatus,
                        'updated_at' => date('Y-m-d H:i:s')
                    ]);

                    // Also update delivery items status
                    $this->deliveryItemModel->where('delivery_id', $delivery['delivery_id'])
                        ->set(['status' => $deliveryStatus, 'updated_at' => date('Y-m-d H:i:s')])
                        ->update();