app/Controllers/PurchaseRequest.php

    public function index()
    {
        $user = session()->get('user');
        if (!$user) {
            return redirect()->to(base_url('login'));
        }

        $branchId = null;
        if (in_array($user['role'], ['Inventory Staff', 'Branch Manager']) && isset($user['branch_id'])) {
            $branchId = $user['branch_id'];
        }

        $data = [
            'requests' => $this->purchaseRequestModel->getRequestsWithDetails($branchId),
            'stats' => $this->purchaseRequestModel->getStats($branchId),
            'branches' => $this->branchModel->findAll(),
            'items' => $this->itemModel->where('status', 'active')->findAll(),
            'suppliers' => $this->supplierModel->where('status', 'Active')->findAll(),
            'userRole' => $user['role'],
            'branchId' => $branchId,
        ];

        // Load items for each request
        foreach ($data['requests'] as &$request) {
            $request['items'] = $this->purchaseRequestItemModel
                ->where('purchase_request_id', $request['id'])
                ->findAll();
---
SELECT *
FROM `branches`
SELECT *
FROM `items`
WHERE `status` = 'active'
SELECT *
FROM `suppliers`
WHERE `status` = 'Active'
AND `suppliers`.`deleted_at` IS NULL
SELECT *
FROM `purchase_request_items`
WHERE `purchase_request_id` = '2'