app/Controllers/PurchaseOrder.php

SELECT *
FROM `purchase_order_items`
WHERE `purchase_order_id` = '1'
---

        // Load items for each order
        foreach ($data['orders'] as &$order) {
            $order['items'] = $this->purchaseOrderItemModel
                ->where('purchase_order_id', $order['id'])
                ->findAll();

SELECT *
FROM `purchase_orders`
WHERE `purchase_orders`.`id` = '1'
---
    public function scheduleDelivery($id)
    {
        $user = session()->get('user');
        if (!$user || $user['role'] !== 'Supplier') {
            return $this->response->setJSON(['success' => false, 'message' => 'Unauthorized - Supplier access only']);
        }

        try {
            $order = $this->purchaseOrderModel->find($id);

SELECT *
FROM `suppliers`
WHERE `suppliers`.`deleted_at` IS NULL
AND `suppliers`.`id` = '1'
SELECT *
FROM `purchase_order_items`
WHERE `purchase_order_id` = '1'
---
    public function supplierOrders()
    {
        $user = session()->get('user');
        if (!$user || $user['role'] !== 'Supplier') {
            return redirect()->to(base_url('login'));
        }

        $supplierId = $user['supplier_id'] ?? null;
        if (!$supplierId) {
            return redirect()->to(base_url('dashboard'))->with('error', 'Supplier account not properly configured');
        }

        // Get supplier info
        $supplier = $this->supplierModel->find($supplierId);

        $data = [
            'orders' => $this->purchaseOrderModel->getOrdersWithDetails(null, $supplierId),
            'stats' => $this->purchaseOrderModel->getStats(null, $supplierId),
            'supplier' => $supplier,
        ];

        // Load items for each order
        foreach ($data['orders'] as &$order) {
            $order['items'] = $this->purchaseOrderItemModel
                ->where('purchase_order_id', $order['id'])
                ->findAll();