app/Controllers/Suppliers.php

SELECT suppliers.*, CASE WHEN suppliers.deleted_at IS NOT NULL THEN 1 ELSE 0 END as is_deleted
FROM `suppliers`
ORDER BY `suppliers`.`id` DESC
---
            // Try direct query to ensure suppliers are fetched
            $db = \Config\Database::connect();
            try {
                $suppliers = $db->table('suppliers')
                    ->select('suppliers.*, CASE WHEN suppliers.deleted_at IS NOT NULL THEN 1 ELSE 0 END as is_deleted', false)
                    ->orderBy('suppliers.id', 'DESC')
                    ->get()
                    ->getResultArray();