app/Controllers/UserController.php

    public function index()
    {
        $redirect = $this->checkAdminAccess();
        if ($redirect) return $redirect;

        $currentUser = session()->get('user');

        $data = [
            'users' => $this->userModel->getUsersWithDetails(),
            'branches' => $this->branchModel->findAll(),
            'suppliers' => $this->supplierModel->findAll(),
            'title' => 'User Management',
            'currentUserId' => $currentUser['id']
        ];
---
SELECT *
FROM `branches`
SELECT *
FROM `suppliers`

    public function edit($id)
    {
        $redirect = $this->checkAdminAccess();
        if ($redirect) return $redirect;

        // Validate ID
        if (!is_numeric($id) || $id <= 0) {
            return redirect()->to(base_url('users'))->with('error', 'Invalid user ID');
        }

        // Get user data
        $user = $this->userModel->find($id);
        if (!$user) {
            return redirect()->to(base_url('users'))->with('error', 'User not found');
        }

        // Get branches and suppliers for dropdowns
        $branches = $this->branchModel->findAll();
        $suppliers = $this->supplierModel->findAll();
---
SELECT *
FROM `users`
WHERE `id` = '7'
SELECT *
FROM `branches`
SELECT *
FROM `suppliers`