app/Models/AlertModel.php

SELECT *
FROM `alerts`
WHERE `status` = 'active'
AND `branch_id` = '1'
ORDER BY `severity` DESC, `created_at` DESC
---
    public function getActiveAlerts($branchId = null)
    {
        $builder = $this->where('status', 'active');

        if ($branchId !== null) {
            $builder->where('branch_id', $branchId);
        }

        return $builder->orderBy('severity', 'DESC')
                      ->orderBy('created_at', 'DESC')
                      ->findAll();

SELECT `severity`, COUNT(*) as count
FROM `alerts`
WHERE `status` = 'active'
AND `branch_id` = '1'
GROUP BY `severity`
---
    public function getAlertCounts($branchId = null)
    {
        $builder = $this->select('severity, COUNT(*) as count')
                       ->where('status', 'active');

        if ($branchId !== null) {
            $builder->where('branch_id', $branchId);
        }

        $results = $builder->groupBy('severity')
                           ->findAll();