app/Models/AlertModel.php

    public function getActiveAlerts($branchId = null)
    {
        $builder = $this->where('is_read', false);

        if ($branchId !== null) {
            $builder->where('branch_id', $branchId);
        }

        return $builder->orderBy('severity', 'DESC')
                      ->orderBy('created_at', 'DESC')
                      ->findAll();
---
SELECT *
FROM `alerts`
WHERE `is_read` = 0
AND `branch_id` = '1'
ORDER BY `severity` DESC, `created_at` DESC

    public function createAlert($data)
    {
        // Check for existing active alert first
        $existingActive = $this->where('alert_type', $data['alert_type'])
                              ->where('status', 'active')
                              ->where('branch_id', $data['branch_id'] ?? null)
                              ->where('item_id', $data['item_id'] ?? null)
                              ->first();

        if ($existingActive) {
            // Update existing active alert
            return $this->update($existingActive['id'], [
                'message' => $data['message'],
                'updated_at' => date('Y-m-d H:i:s')
            ]);
        }

        // Check if there's a recently acknowledged alert (within last 24 hours)
        // Don't create new alerts for recently acknowledged issues
        $recentlyAcknowledged = $this->where('alert_type', $data['alert_type'])
                                    ->where('status', 'acknowledged')
                                    ->where('branch_id', $data['branch_id'] ?? null)
                                    ->where('item_id', $data['item_id'] ?? null)
                                    ->where('acknowledged_at >', date('Y-m-d H:i:s', strtotime('-24 hours')))
                                    ->first();
---
SELECT *
FROM `alerts`
WHERE `alert_type` = 'out_of_stock'
AND `status` = 'active'
AND `branch_id` = '1'
AND `item_id` = '2'
 LIMIT 1
SELECT *
FROM `alerts`
WHERE `alert_type` = 'out_of_stock'
AND `status` = 'acknowledged'
AND `branch_id` = '1'
AND `item_id` = '2'
AND `acknowledged_at` > '2025-11-26 12:41:02'
 LIMIT 1

    public function getAlertCounts($branchId = null)
    {
        $builder = $this->select('severity, COUNT(*) as count')
                       ->where('is_read', false);

        if ($branchId !== null) {
            $builder->where('branch_id', $branchId);
        }

        $results = $builder->groupBy('severity')
                           ->findAll();
---
SELECT `severity`, COUNT(*) as count
FROM `alerts`
WHERE `is_read` = 0
AND `branch_id` = '1'
GROUP BY `severity`