app/Models/DeliveryModel.php

    public function generateDeliveryId()
    {
        $lastDelivery = $this->orderBy('id', 'DESC')->first();
---
SELECT *
FROM `deliveries`
ORDER BY `id` DESC
 LIMIT 1