app/Models/PurchaseRequestModel.php

    public function getRequestsWithDetails($branchId = null)
    {
        $db = \Config\Database::connect();
        $query = $db->table('purchase_requests pr')
            ->select('pr.*, b.name as branch_name,
                     u1.username as created_by_name,
                     u2.username as approved_by_name')
            ->join('branches b', 'pr.branch_id = b.id', 'left')
            ->join('users u1', 'pr.created_by = u1.id', 'left')
            ->join('users u2', 'pr.approved_by = u2.id', 'left')
            ->orderBy('pr.created_at', 'DESC');

        if ($branchId) {
            $query->where('pr.branch_id', $branchId);
        }

        return $query->get()->getResultArray();
---
SELECT `pr`.*, `b`.`name` as `branch_name`, `u1`.`username` as `requested_by_name`, `u2`.`username` as `approved_by_name`
FROM `purchase_requests` `pr`
LEFT JOIN `branches` `b` ON `pr`.`branch_id` = `b`.`id`
LEFT JOIN `users` `u1` ON `pr`.`requested_by` = `u1`.`id`
LEFT JOIN `users` `u2` ON `pr`.`approved_by` = `u2`.`id`
WHERE `pr`.`branch_id` = '1'
ORDER BY `pr`.`created_at` DESC

    public function getRequestWithItems($requestId)
    {
        $request = $this->find($requestId);
        if (!$request) {
            return null;
        }

        $db = \Config\Database::connect();
        $items = $db->table('purchase_request_items pri')
            ->select('pri.*, i.name as item_name_from_db, i.unit as item_unit_from_db')
            ->join('items i', 'pri.item_id = i.id', 'left')
            ->where('pri.purchase_request_id', $requestId)
            ->get()
            ->getResultArray();
---
SELECT `pri`.*, `i`.`name` as `item_name_from_db`, `i`.`unit` as `item_unit_from_db`
FROM `purchase_request_items` `pri`
LEFT JOIN `items` `i` ON `pri`.`item_id` = `i`.`id`
WHERE `pri`.`purchase_request_id` = '6'

    public function getStats($branchId = null)
    {
        $query = $this;
        if ($branchId) {
            $query = $query->where('branch_id', $branchId);
        }

        return [
            'total' => $query->countAllResults(false),
            'pending_central_office_review' => $query->where('status', 'pending_central_office_review')->countAllResults(false),
            'approved' => $query->where('status', 'approved')->countAllResults(false),
            'rejected' => $query->where('status', 'rejected')->countAllResults(false),
            'converted' => $query->where('status', 'converted')->countAllResults(false),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `purchase_requests`
WHERE `branch_id` = '1'
AND `status` = 'pending'
AND `status` = 'pending central office review'
AND `status` = 'approved'
AND `status` = 'rejected'