app/Models/PurchaseRequestModel.php

    public function getRequestWithItems($requestId)
    {
        $db = \Config\Database::connect();

        // Get request with branch and requester/approver names
        $request = $db->table('purchase_requests pr')
            ->select('pr.*, b.name as branch_name, u1.username as requested_by_name, u2.username as approved_by_name')
            ->join('branches b', 'pr.branch_id = b.id', 'left')
            ->join('users u1', 'pr.requested_by = u1.id', 'left')
            ->join('users u2', 'pr.approved_by = u2.id', 'left')
            ->where('pr.id', $requestId)
            ->get()
            ->getRowArray();
---
SELECT `pr`.*, `b`.`name` as `branch_name`, `u1`.`username` as `requested_by_name`, `u2`.`username` as `approved_by_name`
FROM `purchase_requests` `pr`
LEFT JOIN `branches` `b` ON `pr`.`branch_id` = `b`.`id`
LEFT JOIN `users` `u1` ON `pr`.`requested_by` = `u1`.`id`
LEFT JOIN `users` `u2` ON `pr`.`approved_by` = `u2`.`id`
WHERE `pr`.`id` = '6'

    public function getStats($branchId = null)
    {
        $query = $this;
        if ($branchId) {
            $query = $query->where('branch_id', $branchId);
        }

        return [
            'total' => $query->countAllResults(false),
            'pending' => $query->where('status', 'pending')->countAllResults(false),
            'pending_central_office_review' => $query->where('status', 'pending central office review')->countAllResults(false),
            'approved' => $query->where('status', 'approved')->countAllResults(false),
            'rejected' => $query->where('status', 'rejected')->countAllResults(false),
            'converted' => $query->where('status', 'converted')->countAllResults(false),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `purchase_requests`
WHERE `branch_id` = '1'
AND `status` = 'pending'
AND `status` = 'pending central office review'
AND `status` = 'approved'
AND `status` = 'rejected'
AND `status` = 'converted'