app/Models/PurchaseOrderModel.php

SELECT `po`.*, `s`.`supplier_name`, `b`.`name` as `branch_name`, `u1`.`username` as `created_by_name`, `u2`.`username` as `approved_by_name`, `pr`.`request_id` as `pr_request_id`
FROM `purchase_orders` `po`
LEFT JOIN `suppliers` `s` ON `po`.`supplier_id` = `s`.`id`
LEFT JOIN `branches` `b` ON `po`.`branch_id` = `b`.`id`
LEFT JOIN `users` `u1` ON `po`.`created_by` = `u1`.`id`
LEFT JOIN `users` `u2` ON `po`.`approved_by` = `u2`.`id`
LEFT JOIN `purchase_requests` `pr` ON `po`.`purchase_request_id` = `pr`.`id`
WHERE `po`.`supplier_id` = '1'
ORDER BY `po`.`created_at` DESC
---
    public function getOrdersWithDetails($branchId = null, $supplierId = null)
    {
        $db = \Config\Database::connect();
        $query = $db->table('purchase_orders po')
            ->select('po.*, s.supplier_name, b.name as branch_name,
                     u1.username as created_by_name,
                     u2.username as approved_by_name,
                     pr.request_id as pr_request_id')
            ->join('suppliers s', 'po.supplier_id = s.id', 'left')
            ->join('branches b', 'po.branch_id = b.id', 'left')
            ->join('users u1', 'po.created_by = u1.id', 'left')
            ->join('users u2', 'po.approved_by = u2.id', 'left')
            ->join('purchase_requests pr', 'po.purchase_request_id = pr.id', 'left')
            ->orderBy('po.created_at', 'DESC');

        if ($branchId) {
            $query->where('po.branch_id', $branchId);
        }

        if ($supplierId) {
            $query->where('po.supplier_id', $supplierId);
        }

        return $query->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
WHERE `supplier_id` = '1'
AND `status` = 'pending'
AND `status` = 'po_issued_to_supplier'
AND `status` = 'scheduled_for_delivery'
AND `status` = 'ordered'
AND `status` = 'in_transit'
AND `status` = 'delayed'
AND `status` = 'arriving'
AND `status` = 'delivered'
AND `status` = 'delivered_to_branch'
AND `status` = 'completed'
---
    public function getStats($branchId = null, $supplierId = null)
    {
        $query = $this;
        if ($branchId) {
            $query = $query->where('branch_id', $branchId);
        }

        if ($supplierId) {
            $query = $query->where('supplier_id', $supplierId);
        }

        return [
            'total' => $query->countAllResults(false),
            'pending' => $query->where('status', 'pending')->countAllResults(false),
            'po_issued_to_supplier' => $query->where('status', 'po_issued_to_supplier')->countAllResults(false),
            'scheduled_for_delivery' => $query->where('status', 'scheduled_for_delivery')->countAllResults(false),
            'ordered' => $query->where('status', 'ordered')->countAllResults(false),
            'in_transit' => $query->where('status', 'in_transit')->countAllResults(false),
            'delayed' => $query->where('status', 'delayed')->countAllResults(false),
            'arriving' => $query->where('status', 'arriving')->countAllResults(false),
            'delivered' => $query->where('status', 'delivered')->countAllResults(false),
            'delivered_to_branch' => $query->where('status', 'delivered_to_branch')->countAllResults(false),
            'completed' => $query->where('status', 'completed')->countAllResults(false),
        ];