app/Models/SupplierModel.php

SELECT COUNT(*) AS `numrows`
FROM `suppliers`
SELECT COUNT(*) AS `numrows`
FROM `suppliers`
WHERE `status` = 'Active'
AND `deleted_at` IS NULL
AND `status` = 'Pending'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `suppliers`
WHERE `status` = 'Active'
AND `deleted_at` IS NULL
AND `status` = 'Pending'
AND `deleted_at` IS NULL
AND `status` = 'Inactive'
AND `deleted_at` IS NULL
---
    public function getStats()
    {
        // Total suppliers
        $total = $this->countAllResults(false);

        // Active suppliers
        $active = $this->where('status', 'Active')->countAllResults(false);

        // Inactive suppliers
        $inactive = $this->where('status', 'Inactive')->countAllResults(false);