app/Models/UserModel.php

	public function getUsersWithDetails()
	{
		$db = \Config\Database::connect();
		return $db->table('users u')
			->select('u.*, b.name as branch_name, s.supplier_name')
			->join('branches b', 'u.branch_id = b.id', 'left')
			->join('suppliers s', 'u.supplier_id = s.id', 'left')
			->orderBy('u.created_at', 'DESC')
			->get()
			->getResultArray();
---
SELECT `u`.*, `b`.`name` as `branch_name`, `s`.`supplier_name`
FROM `users` `u`
LEFT JOIN `branches` `b` ON `u`.`branch_id` = `b`.`id`
LEFT JOIN `suppliers` `s` ON `u`.`supplier_id` = `s`.`id`
ORDER BY `u`.`created_at` DESC